{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\LNabwire\OneDrive - CGIAR\L.Nabwire\git\Maize_Uganda\mippi_UG\baseline\2slides_for_Berber\2slides_for_Berber.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}20 Apr 2023, 13:58:44
{txt}
{com}. 
. import delimited "C:\Users\LNabwire\OneDrive - CGIAR\L.Nabwire\git\Maize_Uganda\mippi_UG\baseline\data\public\baseline.csv", varnames(1)
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{p 0 4 2} Note: Unmatched quote while processing row 337; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 338; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 672; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 673; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 697; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 698; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 1248; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 1249; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 1258; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 1259; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 1327; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 1328; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should c{res}arefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 1638; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 1640; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{text}(229 vars, 2,327 obs)

{com}. 
. count
  {res}2,327
{txt}
{com}. sort farmer_id
{txt}
{com}. drop if farmer_id == ""
{txt}(7 observations deleted)

{com}. count // 2320 total sample
  {res}2,320
{txt}
{com}. 
. ********** GENDER OF THE HOUSEHOLD HEAD ***********
. tab gender // 20% are female headed households.

     {txt}gender {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
     Female {c |}{res}        475       20.47       20.47
{txt}       Male {c |}{res}      1,845       79.53      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,320      100.00
{txt}
{com}. 
. gen sex = gender
{txt}
{com}. replace sex = "1" if sex == "Female"
{txt}(475 real changes made)

{com}. replace sex = "2" if sex == "Male"
{txt}(1,845 real changes made)

{com}. label define sex 1 "Female" 2 "Male"
{txt}
{com}. destring sex, replace
{txt}sex: all characters numeric; {res}replaced {txt}as {res}byte
{txt}
{com}. label values sex sex
{txt}
{com}. label var sex "gender of hh head"
{txt}
{com}. tab sex

  {txt}gender of {c |}
    hh head {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
     Female {c |}{res}        475       20.47       20.47
{txt}       Male {c |}{res}      1,845       79.53      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,320      100.00
{txt}
{com}. 
. **************% OF FARMERS USING IMPROVED SEED ************** 
. // MIPPI baseline data, Q20. Did you use any quality maize seed like **OPV or hybrid seed** in the previous season (Nsambya of 2022) on any of your plots?
. gen improved = quality_use
{txt}
{com}. replace improved = "1" if improved =="Yes"
{txt}(935 real changes made)

{com}. replace improved = "2" if improved =="No"
{txt}(1,372 real changes made)

{com}. destring improved, replace
{txt}improved: all characters numeric; {res}replaced {txt}as {res}byte
{txt}
{com}. recode improved (1=100) (nonmissing=0)
{txt}(2320 changes made to {bf:improved})

{com}. tab improved

   {txt}improved {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,385       59.70       59.70
{txt}        100 {c |}{res}        935       40.30      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,320      100.00
{txt}
{com}. mean improved
{res}
{txt}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 5:2,320}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}improved {c |}{col 14}{res}{space 2} 40.30172{col 26}{space 2} 1.018573{col 37}{space 5} 38.30431{col 51}{space 3} 42.29913
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. mean improved, over (sex)
{res}
{txt}Mean estimation{col 44}{lalign 13:Number of obs}{col 57} = {res}{ralign 5:2,320}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
c.improved@sex {c |}
{space 7}Female  {c |}{col 16}{res}{space 2} 26.10526{col 28}{space 2} 2.017352{col 39}{space 5} 22.14926{col 53}{space 3} 30.06126
{txt}{space 9}Male  {c |}{col 16}{res}{space 2} 43.95664{col 28}{space 2}  1.15583{col 39}{space 5} 41.69007{col 53}{space 3} 46.22321
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
. // which varieties: MIPPI baseline data, Q28. What maize variety did you plant in second season (Nsambya) of 2022 on this ${c -(}plot_select_name{c )-} plot?
. gen varieties = maize_var
{txt}
{com}. replace varieties = "1" if varieties == "Bazooka"
{txt}(159 real changes made)

{com}. replace varieties = "1" if varieties == "KH_series"
{txt}(7 real changes made)

{com}. replace varieties = "1" if varieties == "Longe_10H"
{txt}(317 real changes made)

{com}. replace varieties = "1" if varieties == "Longe_6H"
{txt}(5 real changes made)

{com}. replace varieties = "1" if varieties == "Longe_7H"
{txt}(17 real changes made)

{com}. replace varieties = "1" if varieties == "Other_hybrid"
{txt}(100 real changes made)

{com}. replace varieties = "1" if varieties == "Longe_7R_Kayongo-go"
{txt}(26 real changes made)

{com}. replace varieties = "1" if varieties == "Panner"
{txt}(1 real change made)

{com}. replace varieties = "1" if varieties == "Wema"
{txt}(1 real change made)

{com}. replace varieties = "1" if varieties == "DK"
{txt}(34 real changes made)

{com}. replace varieties = "2" if varieties == "Longe_4"
{txt}(37 real changes made)

{com}. replace varieties = "2" if varieties == "Longe_5"
{txt}(303 real changes made)

{com}. replace varieties = "3" if varieties == "Land_Races"
{txt}(1,207 real changes made)

{com}. replace varieties = "4" if varieties == "98"
{txt}(106 real changes made)

{com}. 
. label define varieties 1 "Hybrids" 2 "OPV" 3 "Landraces" 4 "Don't know"
{txt}
{com}. destring varieties, replace
{txt}varieties: all characters numeric; {res}replaced {txt}as {res}byte
{txt}
{com}. label values varieties varieties
{txt}
{com}. tab varieties // Most farmers use land races (52%), then hybrids (29%), then OPV (15%), the rest--- use other hybrid (5%)

  {txt}varieties {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
    Hybrids {c |}{res}        667       28.75       28.75
{txt}        OPV {c |}{res}        340       14.66       43.41
{txt}  Landraces {c |}{res}      1,207       52.03       95.43
{txt} Don't know {c |}{res}        106        4.57      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,320      100.00
{txt}
{com}. tab varieties sex, col nofreq

           {txt}{c |}   gender of hh head
 varieties {c |}    Female       Male {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
   Hybrids {c |}{res}     19.16      31.22 {txt}{c |}{res}     28.75 
{txt}       OPV {c |}{res}     11.16      15.56 {txt}{c |}{res}     14.66 
{txt} Landraces {c |}{res}     61.05      49.70 {txt}{c |}{res}     52.03 
{txt}Don't know {c |}{res}      8.63       3.52 {txt}{c |}{res}      4.57 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}    100.00     100.00 {txt}{c |}{res}    100.00 
{txt}
{com}. 
. // used bazooka: MIPPI baseline data, Q21. Did you use Bazooka in the second season of **2022 (Nsambya 2022)** on any of your plots? 
. tab bazo_use

   {txt}bazo_use {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         98 {c |}{res}          8        0.34        0.34
{txt}         No {c |}{res}        707       30.47       30.82
{txt}        Yes {c |}{res}        220        9.48       40.30
{txt}        n/a {c |}{res}      1,385       59.70      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,320      100.00
{txt}
{com}. tab bazo_use sex, col nofreq

           {txt}{c |}   gender of hh head
  bazo_use {c |}    Female       Male {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
        98 {c |}{res}      0.00       0.43 {txt}{c |}{res}      0.34 
{txt}        No {c |}{res}     20.00      33.17 {txt}{c |}{res}     30.47 
{txt}       Yes {c |}{res}      6.11      10.35 {txt}{c |}{res}      9.48 
{txt}       n/a {c |}{res}     73.89      56.04 {txt}{c |}{res}     59.70 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}    100.00     100.00 {txt}{c |}{res}    100.00 
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\LNabwire\AppData\Local\Temp\STD25f8_000000.tmp"
{txt}
{com}. mean long_var // overall, farmers have used the varieties they reported for 30years
{res}
{txt}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 5:2,320}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}long_var {c |}{col 14}{res}{space 2} 30.21724{col 26}{space 2} 3.054436{col 37}{space 5} 24.22753{col 51}{space 3} 36.20695
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. mean long_var, over (sex) 
{res}
{txt}Mean estimation{col 44}{lalign 13:Number of obs}{col 57} = {res}{ralign 5:2,320}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
c.long_var@sex {c |}
{space 7}Female  {c |}{col 16}{res}{space 2} 40.42737{col 28}{space 2} 7.689663{col 39}{space 5} 25.34804{col 53}{space 3}  55.5067
{txt}{space 9}Male  {c |}{col 16}{res}{space 2} 27.58862{col 28}{space 2} 3.289676{col 39}{space 5}  21.1376{col 53}{space 3} 34.03963
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}.  
. mean long_var if varieties < 3
{res}
{txt}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 5:1,007}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}long_var {c |}{col 14}{res}{space 2} 8.396226{col 26}{space 2} 1.980326{col 37}{space 5} 4.510184{col 51}{space 3} 12.28227
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. mean long_var if varieties < 3, over (sex)
{res}
{txt}Mean estimation{col 44}{lalign 13:Number of obs}{col 57} = {res}{ralign 5:1,007}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
c.long_var@sex {c |}
{space 7}Female  {c |}{col 16}{res}{space 2} 4.631944{col 28}{space 2} .5381472{col 39}{space 5} 3.575925{col 53}{space 3} 5.687964
{txt}{space 9}Male  {c |}{col 16}{res}{space 2} 9.024334{col 28}{space 2} 2.308526{col 39}{space 5} 4.494256{col 53}{space 3} 13.55441
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
. mean long_var if varieties == 1 // hybrids only, not gender-disaggregated
{res}
{txt}Mean estimation{col 44}{lalign 13:Number of obs}{col 57} = {res}{ralign 3:667}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}long_var {c |}{col 14}{res}{space 2} 5.734633{col 26}{space 2} 1.508127{col 37}{space 5} 2.773376{col 51}{space 3}  8.69589
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. mean long_var if varieties == 1, over (sex) // hybrids only, gender-disaggregated
{res}
{txt}Mean estimation{col 46}{lalign 13:Number of obs}{col 59} = {res}{ralign 3:667}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
c.long_var@sex {c |}
{space 7}Female  {c |}{col 16}{res}{space 2} 4.945055{col 28}{space 2}  .753723{col 39}{space 5} 3.465096{col 53}{space 3} 6.425014
{txt}{space 9}Male  {c |}{col 16}{res}{space 2} 5.859375{col 28}{space 2} 1.742515{col 39}{space 5} 2.437891{col 53}{space 3} 9.280859
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
. mean long_var if varieties == 2 // OPVs only, not gender-disaggregated
{res}
{txt}Mean estimation{col 44}{lalign 13:Number of obs}{col 57} = {res}{ralign 3:340}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}long_var {c |}{col 14}{res}{space 2} 13.61765{col 26}{space 2}  5.05778{col 37}{space 5} 3.669062{col 51}{space 3} 23.56623
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. mean long_var if varieties == 2, over (sex) // OPVs only, gender-disaggregated
{res}
{txt}Mean estimation{col 46}{lalign 13:Number of obs}{col 59} = {res}{ralign 3:340}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
c.long_var@sex {c |}
{space 7}Female  {c |}{col 16}{res}{space 2}  4.09434{col 28}{space 2} .6832349{col 39}{space 5} 2.750426{col 53}{space 3} 5.438253
{txt}{space 9}Male  {c |}{col 16}{res}{space 2} 15.37631{col 28}{space 2} 5.986329{col 39}{space 5} 3.601279{col 53}{space 3} 27.15133
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
. 
. // period of use for specific varietyplanted
. gen variety = maize_var
{txt}
{com}. 
. replace variety = "1" if variety == "Bazooka"
{txt}(159 real changes made)

{com}. replace variety = "2" if variety == "KH_series"
{txt}(7 real changes made)

{com}. replace variety = "3" if variety == "Longe_10H"
{txt}(317 real changes made)

{com}. replace variety = "4" if variety == "Longe_6H"
{txt}(5 real changes made)

{com}. replace variety = "5" if variety == "Longe_7H"
{txt}(17 real changes made)

{com}. replace variety = "6" if variety == "Other_hybrid"
{txt}(100 real changes made)

{com}. replace variety = "7" if variety == "Longe_7R_Kayongo-go"
{txt}(26 real changes made)

{com}. replace variety = "8" if variety == "Panner"
{txt}(1 real change made)

{com}. replace variety = "9" if variety == "Wema"
{txt}(1 real change made)

{com}. replace variety = "10" if variety == "DK"
{txt}(34 real changes made)

{com}. replace variety = "11" if variety == "Longe_4"
{txt}(37 real changes made)

{com}. replace variety = "12" if variety == "Longe_5"
{txt}(303 real changes made)

{com}. replace variety = "13" if variety == "Land_Races"
{txt}(1,207 real changes made)

{com}. destring variety, replace
{txt}variety: all characters numeric; {res}replaced {txt}as {res}byte
{txt}
{com}. 
. label define variety 1 "Bazooka" 2 "KH_series" 3 "Longe_10H" 4 "Longe_6H" 5 "Longe_7H" 6 "Other_hybrid" 7 "Longe_7R_Kayongo-go" 8 "Panner" 9 "Wema" 10 "DK" 11 "Longe_4" 12 "Longe_5" 13 "Land_Races"
{txt}
{com}. 
. label values variety variety
{txt}
{com}. 
. mean long_var, over (variety) // period (years) that the farmer has used specific varieties
{res}
{txt}Mean estimation{col 50}{lalign 13:Number of obs}{col 63} = {res}{ralign 5:2,320}

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 22}{c |}       Mean{col 34}   Std. err.{col 46}     [95% con{col 59}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 2}c.long_var@variety {c |}
{space 12}Bazooka  {c |}{col 22}{res}{space 2} 2.194969{col 34}{space 2}  .137499{col 45}{space 5} 1.925335{col 59}{space 3} 2.464602
{txt}{space 10}KH_series  {c |}{col 22}{res}{space 2} 1.285714{col 34}{space 2} .2857143{col 45}{space 5} .7254321{col 59}{space 3} 1.845996
{txt}{space 10}Longe_10H  {c |}{col 22}{res}{space 2} 7.031546{col 34}{space 2} 3.145663{col 45}{space 5} .8629395{col 59}{space 3} 13.20015
{txt}{space 11}Longe_6H  {c |}{col 22}{res}{space 2}      3.6{col 34}{space 2} 1.208305{col 45}{space 5}  1.23053{col 59}{space 3}  5.96947
{txt}{space 11}Longe_7H  {c |}{col 22}{res}{space 2} 2.941176{col 34}{space 2} .6386486{col 45}{space 5} 1.688795{col 59}{space 3} 4.193558
{txt}{space 7}Other_hybrid  {c |}{col 22}{res}{space 2}      9.7{col 34}{space 2} 1.153169{col 45}{space 5} 7.438651{col 59}{space 3} 11.96135
{txt}Longe_7R_Kayongo-go  {c |}{col 22}{res}{space 2} 3.807692{col 34}{space 2} .5948994{col 45}{space 5} 2.641102{col 59}{space 3} 4.974283
{txt}{space 13}Panner  {c |}{col 22}{res}{space 2}        3{col 34}{space 2}        .{col 45}{space 5}        .{col 59}{space 3}        .
{txt}{space 15}Wema  {c |}{col 22}{res}{space 2}        1{col 34}{space 2}        .{col 45}{space 5}        .{col 59}{space 3}        .
{txt}{space 17}DK  {c |}{col 22}{res}{space 2} 2.852941{col 34}{space 2} .5375928{col 45}{space 5} 1.798729{col 59}{space 3} 3.907154
{txt}{space 12}Longe_4  {c |}{col 22}{res}{space 2} 4.054054{col 34}{space 2} .7186344{col 45}{space 5} 2.644821{col 59}{space 3} 5.463287
{txt}{space 12}Longe_5  {c |}{col 22}{res}{space 2} 14.78548{col 34}{space 2}   5.6721{col 45}{space 5} 3.662561{col 59}{space 3}  25.9084
{txt}{space 9}Land_Races  {c |}{col 22}{res}{space 2} 48.68517{col 34}{space 2} 5.459734{col 45}{space 5}  37.9787{col 59}{space 3} 59.39164
{txt}{space 17}98  {c |}{col 22}{res}{space 2} 27.22642{col 34}{space 2} 13.19608{col 45}{space 5} 1.349061{col 59}{space 3} 53.10377
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. mean long_var if sex == 1, over (variety) // period (years) that the farmer has used specific varieties, female headed hhs
{res}
{txt}Mean estimation{col 52}{lalign 13:Number of obs}{col 65} = {res}{ralign 3:475}

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 22}{c |}       Mean{col 34}   Std. err.{col 46}     [95% con{col 59}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 2}c.long_var@variety {c |}
{space 12}Bazooka  {c |}{col 22}{res}{space 2}    1.875{col 34}{space 2} .3145764{col 45}{space 5} 1.256863{col 59}{space 3} 2.493137
{txt}{space 10}Longe_10H  {c |}{col 22}{res}{space 2} 3.131579{col 34}{space 2} .3640515{col 45}{space 5} 2.416225{col 59}{space 3} 3.846933
{txt}{space 11}Longe_6H  {c |}{col 22}{res}{space 2}        7{col 34}{space 2}        .{col 45}{space 5}        .{col 59}{space 3}        .
{txt}{space 11}Longe_7H  {c |}{col 22}{res}{space 2}      1.5{col 34}{space 2}       .5{col 45}{space 5} .5175093{col 59}{space 3} 2.482491
{txt}{space 7}Other_hybrid  {c |}{col 22}{res}{space 2} 11.16667{col 34}{space 2} 2.368778{col 45}{space 5} 6.512061{col 59}{space 3} 15.82127
{txt}Longe_7R_Kayongo-go  {c |}{col 22}{res}{space 2} 3.666667{col 34}{space 2} 2.185813{col 45}{space 5}-.6284148{col 59}{space 3} 7.961748
{txt}{space 13}Panner  {c |}{col 22}{res}{space 2}        3{col 34}{space 2}        .{col 45}{space 5}        .{col 59}{space 3}        .
{txt}{space 17}DK  {c |}{col 22}{res}{space 2}      1.5{col 34}{space 2}  .341565{col 45}{space 5} .8288311{col 59}{space 3} 2.171169
{txt}{space 12}Longe_4  {c |}{col 22}{res}{space 2} 2.666667{col 34}{space 2} .4714045{col 45}{space 5} 1.740366{col 59}{space 3} 3.592968
{txt}{space 12}Longe_5  {c |}{col 22}{res}{space 2} 4.386364{col 34}{space 2} .8123101{col 45}{space 5} 2.790189{col 59}{space 3} 5.982538
{txt}{space 9}Land_Races  {c |}{col 22}{res}{space 2} 58.96897{col 34}{space 2} 11.99777{col 45}{space 5} 35.39357{col 59}{space 3} 82.54436
{txt}{space 17}98  {c |}{col 22}{res}{space 2}       35{col 34}{space 2} 24.16645{col 45}{space 5}-12.48661{col 59}{space 3} 82.48661
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. mean long_var if sex == 2, over (variety) // period (years) that the farmer has used specific varieties, male headed hhs
{res}
{txt}Mean estimation{col 50}{lalign 13:Number of obs}{col 63} = {res}{ralign 5:1,845}

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 22}{c |}       Mean{col 34}   Std. err.{col 46}     [95% con{col 59}f. interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 2}c.long_var@variety {c |}
{space 12}Bazooka  {c |}{col 22}{res}{space 2} 2.230769{col 34}{space 2} .1487637{col 45}{space 5} 1.939006{col 59}{space 3} 2.522532
{txt}{space 10}KH_series  {c |}{col 22}{res}{space 2} 1.285714{col 34}{space 2} .2857143{col 45}{space 5} .7253568{col 59}{space 3} 1.846072
{txt}{space 10}Longe_10H  {c |}{col 22}{res}{space 2} 7.562724{col 34}{space 2} 3.573355{col 45}{space 5} .5544773{col 59}{space 3} 14.57097
{txt}{space 11}Longe_6H  {c |}{col 22}{res}{space 2}     2.75{col 34}{space 2} 1.108678{col 45}{space 5}  .575604{col 59}{space 3} 4.924396
{txt}{space 11}Longe_7H  {c |}{col 22}{res}{space 2} 3.133333{col 34}{space 2} .7095717{col 45}{space 5} 1.741685{col 59}{space 3} 4.524982
{txt}{space 7}Other_hybrid  {c |}{col 22}{res}{space 2} 9.236842{col 34}{space 2} 1.324515{col 45}{space 5} 6.639135{col 59}{space 3} 11.83455
{txt}Longe_7R_Kayongo-go  {c |}{col 22}{res}{space 2} 3.826087{col 34}{space 2} .6307414{col 45}{space 5} 2.589045{col 59}{space 3} 5.063129
{txt}{space 15}Wema  {c |}{col 22}{res}{space 2}        1{col 34}{space 2}        .{col 45}{space 5}        .{col 59}{space 3}        .
{txt}{space 17}DK  {c |}{col 22}{res}{space 2} 3.142857{col 34}{space 2} .6376924{col 45}{space 5} 1.892182{col 59}{space 3} 4.393532
{txt}{space 12}Longe_4  {c |}{col 22}{res}{space 2}      4.5{col 34}{space 2} .9265342{col 45}{space 5} 2.682834{col 59}{space 3} 6.317166
{txt}{space 12}Longe_5  {c |}{col 22}{res}{space 2} 16.55212{col 34}{space 2}  6.62988{col 45}{space 5} 3.549262{col 59}{space 3} 29.55499
{txt}{space 9}Land_Races  {c |}{col 22}{res}{space 2} 45.43293{col 34}{space 2} 6.103015{col 45}{space 5} 33.46339{col 59}{space 3} 57.40248
{txt}{space 17}98  {c |}{col 22}{res}{space 2} 22.32308{col 34}{space 2} 15.31961{col 45}{space 5}-7.722527{col 59}{space 3} 52.36868
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
. save "C:\Users\LNabwire\OneDrive - CGIAR\L.Nabwire\git\Maize_Uganda\mippi_UG\baseline\2slides_for_Berber\2slides_for_Berber.dta", replace
{txt}{p 0 4 2}
file {bf}
C:\Users\LNabwire\OneDrive - CGIAR\L.Nabwire\git\Maize_Uganda\mippi_UG\baseline\2slides_for_Berber\2slides_for_Berber.dta{rm}
saved
{p_end}

{com}. 
{txt}end of do-file

{com}. do "C:\Users\LNabwire\AppData\Local\Temp\STD25f8_000000.tmp"
{txt}
{com}. clear
{txt}
{com}. import delimited "C:\Users\LNabwire\OneDrive - CGIAR\L.Nabwire\git\Maize_Dairy_Ug\USAID_SME_project\Country folders\Uganda maize\data\public\wave_0\farmers.csv", varnames(1) 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{p 0 4 2} Note: Unmatched quote while processing row 1065; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 1066; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 1122; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 1123; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{text}(426 vars, 1,529 obs)

{com}. 
. count
  {res}1,529
{txt}
{com}. sort id
{txt}
{com}. ed
{txt}
{com}. drop if date == ""
{txt}(2 observations deleted)

{com}. 
. 
. // rating the importance (1 to 5) of the reasons for using the a given variety on a given plot 
. 
. // First, varieties planted on the selected plot in 2018
. replace hhmaizemaizenq48 = "1" if hhmaizemaizenq48 == "a"
{txt}(254 real changes made)

{com}. replace hhmaizemaizenq48 = "2" if hhmaizemaizenq48 == "b"
{txt}(43 real changes made)

{com}. replace hhmaizemaizenq48 = "3" if hhmaizemaizenq48 == "c"
{txt}(32 real changes made)

{com}. replace hhmaizemaizenq48 = "4" if hhmaizemaizenq48 == "d"
{txt}(5 real changes made)

{com}. replace hhmaizemaizenq48 = "5" if hhmaizemaizenq48 == "e"
{txt}(9 real changes made)

{com}. replace hhmaizemaizenq48 = "6" if hhmaizemaizenq48 == "f"
{txt}(353 real changes made)

{com}. replace hhmaizemaizenq48 = "7" if hhmaizemaizenq48 == "g"
{txt}(75 real changes made)

{com}. replace hhmaizemaizenq48 = "8" if hhmaizemaizenq48 == "h"
{txt}(4 real changes made)

{com}. replace hhmaizemaizenq48 = "9" if hhmaizemaizenq48 == "i"
{txt}(2 real changes made)

{com}. replace hhmaizemaizenq48 = "10" if hhmaizemaizenq48 == "j"
{txt}(25 real changes made)

{com}. replace hhmaizemaizenq48 = "11" if hhmaizemaizenq48 == "k"
{txt}(480 real changes made)

{com}. replace hhmaizemaizenq48 = "12" if hhmaizemaizenq48 == "l"
{txt}(141 real changes made)

{com}. 
. destring hhmaizemaizenq48, replace
{txt}hhmaizemaizenq48: all characters numeric; {res}replaced {txt}as {res}byte
{txt}
{com}. 
. gen variety = hhmaizemaizenq48
{txt}
{com}. label define variety 1 "Longe 10H" 2 "Longe 7H" 3 "Longe 7R/Kayongo-go" 4 "Bazooka" 5 "Longe 6H" 6 "Longe 5 (nalongo)" 7 "Longe 4" 8 "Panner" 9 "Wema" 10 "KH series" 11 "Land Races/local varieties" 12 "Others" 98 "Don't know"
{txt}
{com}. label values variety variety
{txt}
{com}. // variety planted on the selected plot
. tab variety

                   {txt}variety {c |}      Freq.     Percent        Cum.
{hline 27}{c +}{hline 35}
                 Longe 10H {c |}{res}        254       16.63       16.63
{txt}                  Longe 7H {c |}{res}         43        2.82       19.45
{txt}       Longe 7R/Kayongo-go {c |}{res}         32        2.10       21.55
{txt}                   Bazooka {c |}{res}          5        0.33       21.87
{txt}                  Longe 6H {c |}{res}          9        0.59       22.46
{txt}         Longe 5 (nalongo) {c |}{res}        353       23.12       45.58
{txt}                   Longe 4 {c |}{res}         75        4.91       50.49
{txt}                    Panner {c |}{res}          4        0.26       50.75
{txt}                      Wema {c |}{res}          2        0.13       50.88
{txt}                 KH series {c |}{res}         25        1.64       52.52
{txt}Land Races/local varieties {c |}{res}        480       31.43       83.96
{txt}                    Others {c |}{res}        141        9.23       93.19
{txt}                Don't know {c |}{res}        104        6.81      100.00
{txt}{hline 27}{c +}{hline 35}
                     Total {c |}{res}      1,527      100.00
{txt}
{com}. 
. // grouping the varieties used on a randomly selected plot in 2019 into hybrids, OPV and landraces
. gen varietyCAT = variety
{txt}
{com}. recode varietyCAT (1=1) (2=1) (3=1) (4=1) (5=1) (8=1) (9=1) (10=1) (11=3) (98=98) (12=12) (nonmissing=2) 
{txt}(1028 changes made to {bf:varietyCAT})

{com}. tab1 variety varietyCAT

{res}-> tabulation of variety  

                   {txt}variety {c |}      Freq.     Percent        Cum.
{hline 27}{c +}{hline 35}
                 Longe 10H {c |}{res}        254       16.63       16.63
{txt}                  Longe 7H {c |}{res}         43        2.82       19.45
{txt}       Longe 7R/Kayongo-go {c |}{res}         32        2.10       21.55
{txt}                   Bazooka {c |}{res}          5        0.33       21.87
{txt}                  Longe 6H {c |}{res}          9        0.59       22.46
{txt}         Longe 5 (nalongo) {c |}{res}        353       23.12       45.58
{txt}                   Longe 4 {c |}{res}         75        4.91       50.49
{txt}                    Panner {c |}{res}          4        0.26       50.75
{txt}                      Wema {c |}{res}          2        0.13       50.88
{txt}                 KH series {c |}{res}         25        1.64       52.52
{txt}Land Races/local varieties {c |}{res}        480       31.43       83.96
{txt}                    Others {c |}{res}        141        9.23       93.19
{txt}                Don't know {c |}{res}        104        6.81      100.00
{txt}{hline 27}{c +}{hline 35}
                     Total {c |}{res}      1,527      100.00

-> tabulation of varietyCAT  

 {txt}varietyCAT {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        374       24.49       24.49
{txt}          2 {c |}{res}        428       28.03       52.52
{txt}          3 {c |}{res}        480       31.43       83.96
{txt}         12 {c |}{res}        141        9.23       93.19
{txt}         98 {c |}{res}        104        6.81      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,527      100.00
{txt}
{com}. 
. label define varietyCAT 1 "Hybrids" 2 "OPVs" 3 "Landraces" 12 "Others" 98 "Don't know"
{txt}
{com}. label values varietyCAT varietyCAT
{txt}
{com}. tab varietyCAT

 {txt}varietyCAT {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
    Hybrids {c |}{res}        374       24.49       24.49
{txt}       OPVs {c |}{res}        428       28.03       52.52
{txt}  Landraces {c |}{res}        480       31.43       83.96
{txt}     Others {c |}{res}        141        9.23       93.19
{txt} Don't know {c |}{res}        104        6.81      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,527      100.00
{txt}
{com}. 
. // rating the importance (1 to 5) of the reasons for using the a given variety on a given plot 
. rename hhmaizemaizenq51a highyield_m
{res}{txt}
{com}. rename hhmaizemaizenq51b drought_m
{res}{txt}
{com}. rename hhmaizemaizenq51c pestdisease_m
{res}{txt}
{com}. rename hhmaizemaizenq51d earlymaturing_m
{res}{txt}
{com}. rename hhmaizemaizenq51e highMktPx_m
{res}{txt}
{com}. rename hhmaizemaizenq51f goodtaste_m
{res}{txt}
{com}. rename hhmaizemaizenq51g lowprice_m
{res}{txt}
{com}. rename hhmaizemaizenq51h availability_m
{res}{txt}
{com}. rename hhmaizemaizenq51i germination_m
{res}{txt}
{com}. rename hhmaizemaizenq51j experience_m
{res}{txt}
{com}. 
. label var highyield_m "High yield"
{txt}
{com}. label var drought_m "Drought tolerant"
{txt}
{com}. lab var pestdisease_m "Pest/disease tolerant"
{txt}
{com}. lab var earlymaturing_m "Early maturing"
{txt}
{com}. lab var highMktPx_m "High market price"
{txt}
{com}. lab var highMktPx_m "Higher market price/demand"
{txt}
{com}. lab var goodtaste_m "Good taste or high nutrition"
{txt}
{com}. lab var lowprice_m "Low price for seed"
{txt}
{com}. lab var availability_m "Availability"
{txt}
{com}. lab var germination_m "Germination rate"
{txt}
{com}. lab var experience_m "Experience(knows and trust the quality"
{txt}
{com}. 
. 
. // 2019 mean ratings of the reasons for using a given variety
. sum highyield_m- experience_m // overall sample

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}highyield_m {c |}{res}      1,527    3.474132    1.041954          1          5
{txt}{space 3}drought_m {c |}{res}      1,527    3.027505     1.09474          1          5
{txt}pestdiseas~m {c |}{res}      1,527    2.493124    1.187991          1          5
{txt}earlymatur~m {c |}{res}      1,527    3.640472    1.066473          1          5
{txt}{space 1}highMktPx_m {c |}{res}      1,527    3.520629     1.14628          1          5
{txt}{hline 13}{c +}{hline 57}
{space 1}goodtaste_m {c |}{res}      1,527    4.191225    .9934789          1          5
{txt}{space 2}lowprice_m {c |}{res}      1,527    3.165684     1.27201          1          5
{txt}availabili~m {c |}{res}      1,527    3.902423    1.114206          1          5
{txt}germinatio~m {c |}{res}      1,527    3.800917    1.050956          1          5
{txt}experience_m {c |}{res}      1,527    4.005239    .9967043          1          5
{txt}
{com}. 
. // only improved varieties: 2019 mean ratings of the reasons for using a given variety
. sum highyield_m- experience_m if varietyCAT < 3 // improved varieties (hybrids + OPVs)

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}highyield_m {c |}{res}        802    3.605985    .9890103          1          5
{txt}{space 3}drought_m {c |}{res}        802    3.081047    1.084295          1          5
{txt}pestdiseas~m {c |}{res}        802    2.477556    1.172988          1          5
{txt}earlymatur~m {c |}{res}        802    3.927681    .9519056          1          5
{txt}{space 1}highMktPx_m {c |}{res}        802    3.566085    1.129006          1          5
{txt}{hline 13}{c +}{hline 57}
{space 1}goodtaste_m {c |}{res}        802    4.066085    1.045469          1          5
{txt}{space 2}lowprice_m {c |}{res}        802    3.011222    1.199719          1          5
{txt}availabili~m {c |}{res}        802    3.769327    1.139642          1          5
{txt}germinatio~m {c |}{res}        802    3.874065    1.011964          1          5
{txt}experience_m {c |}{res}        802    3.872818    1.019796          1          5
{txt}
{com}. sum highyield_m- experience_m if varietyCAT < 3 & hhmaizeq25 == "Female"

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}highyield_m {c |}{res}        324    3.675926    .9748735          1          5
{txt}{space 3}drought_m {c |}{res}        324    3.070988    1.083749          1          5
{txt}pestdiseas~m {c |}{res}        324    2.484568    1.122418          1          5
{txt}earlymatur~m {c |}{res}        324    4.003086    .9459003          1          5
{txt}{space 1}highMktPx_m {c |}{res}        324    3.515432    1.091655          1          5
{txt}{hline 13}{c +}{hline 57}
{space 1}goodtaste_m {c |}{res}        324    4.111111    .9953452          1          5
{txt}{space 2}lowprice_m {c |}{res}        324    2.993827    1.201119          1          5
{txt}availabili~m {c |}{res}        324    3.675926    1.176357          1          5
{txt}germinatio~m {c |}{res}        324    3.901235    .9778341          1          5
{txt}experience_m {c |}{res}        324     3.82716    1.008203          1          5
{txt}
{com}. sum highyield_m- experience_m if varietyCAT < 3 & hhmaizeq25 == "Male"

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}highyield_m {c |}{res}        478    3.558577     .996703          1          5
{txt}{space 3}drought_m {c |}{res}        478    3.087866    1.085747          1          5
{txt}pestdiseas~m {c |}{res}        478    2.472803    1.207199          1          5
{txt}earlymatur~m {c |}{res}        478    3.876569    .9535519          1          5
{txt}{space 1}highMktPx_m {c |}{res}        478    3.600418    1.153502          1          5
{txt}{hline 13}{c +}{hline 57}
{space 1}goodtaste_m {c |}{res}        478    4.035565    1.078079          1          5
{txt}{space 2}lowprice_m {c |}{res}        478    3.023013    1.199884          1          5
{txt}availabili~m {c |}{res}        478    3.832636    1.110849          1          5
{txt}germinatio~m {c |}{res}        478    3.855649    1.035066          1          5
{txt}experience_m {c |}{res}        478    3.903766    1.027477          1          5
{txt}
{com}. 
. 
. // per variety category: 2019 mean ratings of the reasons for using a given variety 
. sum highyield_m- experience_m if varietyCAT == 1 // Hybrids

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}highyield_m {c |}{res}        374    3.754011      .92532          1          5
{txt}{space 3}drought_m {c |}{res}        374    3.262032    1.084031          1          5
{txt}pestdiseas~m {c |}{res}        374    2.582888    1.206473          1          5
{txt}earlymatur~m {c |}{res}        374    4.024064    .9417106          1          5
{txt}{space 1}highMktPx_m {c |}{res}        374     3.68984    1.105702          1          5
{txt}{hline 13}{c +}{hline 57}
{space 1}goodtaste_m {c |}{res}        374    4.184492    .9179036          1          5
{txt}{space 2}lowprice_m {c |}{res}        374    3.016043    1.214196          1          5
{txt}availabili~m {c |}{res}        374    3.673797    1.139356          1          5
{txt}germinatio~m {c |}{res}        374    3.970588    .9995662          1          5
{txt}experience_m {c |}{res}        374    3.930481    .9633951          1          5
{txt}
{com}. sum highyield_m- experience_m if varietyCAT == 1 & hhmaizeq25 == "Female"

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}highyield_m {c |}{res}        135    3.874074    .8846083          1          5
{txt}{space 3}drought_m {c |}{res}        135    3.303704    1.038613          1          5
{txt}pestdiseas~m {c |}{res}        135    2.644444    1.136023          1          5
{txt}earlymatur~m {c |}{res}        135    4.140741    .8907733          1          5
{txt}{space 1}highMktPx_m {c |}{res}        135     3.57037    1.129924          1          5
{txt}{hline 13}{c +}{hline 57}
{space 1}goodtaste_m {c |}{res}        135    4.237037    .8482414          1          5
{txt}{space 2}lowprice_m {c |}{res}        135    3.081481    1.209736          1          5
{txt}availabili~m {c |}{res}        135    3.555556    1.163286          1          5
{txt}germinatio~m {c |}{res}        135    4.059259    .9040783          1          5
{txt}experience_m {c |}{res}        135    3.948148    .8666156          2          5
{txt}
{com}. sum highyield_m- experience_m if varietyCAT == 1 & hhmaizeq25 == "Male"

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}highyield_m {c |}{res}        239    3.686192     .942606          1          5
{txt}{space 3}drought_m {c |}{res}        239    3.238494    1.110314          1          5
{txt}pestdiseas~m {c |}{res}        239    2.548117     1.24549          1          5
{txt}earlymatur~m {c |}{res}        239    3.958159    .9648912          1          5
{txt}{space 1}highMktPx_m {c |}{res}        239    3.757322    1.088374          1          5
{txt}{hline 13}{c +}{hline 57}
{space 1}goodtaste_m {c |}{res}        239    4.154812    .9554619          1          5
{txt}{space 2}lowprice_m {c |}{res}        239    2.979079    1.217684          1          5
{txt}availabili~m {c |}{res}        239    3.740586    1.122565          1          5
{txt}germinatio~m {c |}{res}        239    3.920502    1.048187          1          5
{txt}experience_m {c |}{res}        239    3.920502    1.015612          1          5
{txt}
{com}. 
. sum highyield_m- experience_m if varietyCAT == 2 // OPVs

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}highyield_m {c |}{res}        428    3.476636    1.025171          1          5
{txt}{space 3}drought_m {c |}{res}        428    2.922897    1.060749          1          5
{txt}pestdiseas~m {c |}{res}        428    2.385514    1.136359          1          5
{txt}earlymatur~m {c |}{res}        428    3.843458    .9538676          1          5
{txt}{space 1}highMktPx_m {c |}{res}        428    3.457944    1.139295          1          5
{txt}{hline 13}{c +}{hline 57}
{space 1}goodtaste_m {c |}{res}        428    3.962617    1.136371          1          5
{txt}{space 2}lowprice_m {c |}{res}        428    3.007009     1.18833          1          5
{txt}availabili~m {c |}{res}        428    3.852804    1.134644          1          5
{txt}germinatio~m {c |}{res}        428     3.78972    1.016347          1          5
{txt}experience_m {c |}{res}        428     3.82243     1.06521          1          5
{txt}
{com}. sum highyield_m- experience_m if varietyCAT == 2 & hhmaizeq25 == "Female"

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}highyield_m {c |}{res}        189    3.534392     1.01328          1          5
{txt}{space 3}drought_m {c |}{res}        189    2.904762    1.087369          1          5
{txt}pestdiseas~m {c |}{res}        189     2.37037    1.101435          1          5
{txt}earlymatur~m {c |}{res}        189    3.904762    .9738215          1          5
{txt}{space 1}highMktPx_m {c |}{res}        189     3.47619    1.064772          1          5
{txt}{hline 13}{c +}{hline 57}
{space 1}goodtaste_m {c |}{res}        189    4.021164    1.081556          1          5
{txt}{space 2}lowprice_m {c |}{res}        189    2.931217    1.194192          1          5
{txt}availabili~m {c |}{res}        189    3.761905    1.181159          1          5
{txt}germinatio~m {c |}{res}        189     3.78836    1.014612          1          5
{txt}experience_m {c |}{res}        189    3.740741    1.092275          1          5
{txt}
{com}. sum highyield_m- experience_m if varietyCAT == 2 & hhmaizeq25 == "Male"

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}highyield_m {c |}{res}        239    3.430962    1.034308          1          5
{txt}{space 3}drought_m {c |}{res}        239    2.937238    1.041288          1          5
{txt}pestdiseas~m {c |}{res}        239     2.39749    1.165395          1          5
{txt}earlymatur~m {c |}{res}        239    3.794979    .9369941          1          5
{txt}{space 1}highMktPx_m {c |}{res}        239    3.443515    1.196963          1          5
{txt}{hline 13}{c +}{hline 57}
{space 1}goodtaste_m {c |}{res}        239    3.916318    1.178103          1          5
{txt}{space 2}lowprice_m {c |}{res}        239    3.066946    1.182734          1          5
{txt}availabili~m {c |}{res}        239    3.924686    1.093611          1          5
{txt}germinatio~m {c |}{res}        239    3.790795    1.019845          1          5
{txt}experience_m {c |}{res}        239    3.887029    1.041068          1          5
{txt}
{com}. 
. sum highyield_m- experience_m if varietyCAT == 3 // Landraces

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}highyield_m {c |}{res}        480      3.3125    1.062872          1          5
{txt}{space 3}drought_m {c |}{res}        480    2.977083    1.089663          1          5
{txt}pestdiseas~m {c |}{res}        480    2.489583    1.225978          1          5
{txt}earlymatur~m {c |}{res}        480    3.279167    1.087595          1          5
{txt}{space 1}highMktPx_m {c |}{res}        480      3.5625    1.150588          1          5
{txt}{hline 13}{c +}{hline 57}
{space 1}goodtaste_m {c |}{res}        480     4.41875    .8606829          1          5
{txt}{space 2}lowprice_m {c |}{res}        480    3.352083    1.398999          1          5
{txt}availabili~m {c |}{res}        480    4.145833     1.03568          1          5
{txt}germinatio~m {c |}{res}        480    3.702083    1.102661          1          5
{txt}experience_m {c |}{res}        480    4.214583    .9010524          1          5
{txt}
{com}. sum highyield_m- experience_m if varietyCAT == 3 & hhmaizeq25 == "Female"

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}highyield_m {c |}{res}        272    3.297794    1.060667          1          5
{txt}{space 3}drought_m {c |}{res}        272    2.867647    1.050804          1          5
{txt}pestdiseas~m {c |}{res}        272    2.400735    1.176836          1          5
{txt}earlymatur~m {c |}{res}        272    3.257353    1.093397          1          5
{txt}{space 1}highMktPx_m {c |}{res}        272    3.455882    1.180204          1          5
{txt}{hline 13}{c +}{hline 57}
{space 1}goodtaste_m {c |}{res}        272    4.363971    .9029818          1          5
{txt}{space 2}lowprice_m {c |}{res}        272    3.363971    1.386502          1          5
{txt}availabili~m {c |}{res}        272    4.095588    1.065242          1          5
{txt}germinatio~m {c |}{res}        272    3.680147    1.095399          1          5
{txt}experience_m {c |}{res}        272    4.147059    .9373702          1          5
{txt}
{com}. sum highyield_m- experience_m if varietyCAT == 3 & hhmaizeq25 == "Male"

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}highyield_m {c |}{res}        208    3.331731    1.068003          1          5
{txt}{space 3}drought_m {c |}{res}        208    3.120192    1.125023          1          5
{txt}pestdiseas~m {c |}{res}        208    2.605769    1.280989          1          5
{txt}earlymatur~m {c |}{res}        208    3.307692    1.081928          1          5
{txt}{space 1}highMktPx_m {c |}{res}        208    3.701923     1.09791          1          5
{txt}{hline 13}{c +}{hline 57}
{space 1}goodtaste_m {c |}{res}        208    4.490385    .7984912          1          5
{txt}{space 2}lowprice_m {c |}{res}        208    3.336538    1.418379          1          5
{txt}availabili~m {c |}{res}        208    4.211538    .9944102          1          5
{txt}germinatio~m {c |}{res}        208    3.730769     1.11408          1          5
{txt}experience_m {c |}{res}        208    4.302885    .8453289          1          5
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\LNabwire\AppData\Local\Temp\STD25f8_000000.tmp"
{txt}
{com}. use "C:\Users\LNabwire\OneDrive - CGIAR\L.Nabwire\git\Maize_Uganda\mippi_UG\baseline\2slides_for_Berber\2slides_for_Berber.dta", clear
{txt}
{com}. 
. // % of farmers who recycle more than the recommended times (0 times for hybrids and 3 times for OPVs)
. gen oftenx = often
{txt}
{com}. replace oftenx = "1" if oftenx == "a"
{txt}(23 real changes made)

{com}. replace oftenx = "2" if oftenx == "b"
{txt}(167 real changes made)

{com}. replace oftenx = "3" if oftenx == "c"
{txt}(79 real changes made)

{com}. replace oftenx = "4" if oftenx == "d"
{txt}(115 real changes made)

{com}. replace oftenx = "5" if oftenx == "e"
{txt}(58 real changes made)

{com}. replace oftenx = "6" if oftenx == "f"
{txt}(987 real changes made)

{com}. 
. destring oftenx, replace ignore ("n/a")
{txt}oftenx: characters{res} n / a{txt} removed; {res}replaced {txt}as {res}byte
{txt}(798 missing values generated)
{res}{txt}
{com}. 
. gen recycle = oftenx
{txt}(798 missing values generated)

{com}. replace recycle = 100 if oftenx > 1 & varieties == 1 // for hybrids
{txt}(661 real changes made)

{com}. replace recycle = 100 if oftenx > 4 & varieties == 2 // for OPVs
{txt}(262 real changes made)

{com}. recode recycle (100=100) (nonmissing=0)
{txt}(1305 changes made to {bf:recycle})

{com}. tab recycle if varieties < 3

    {txt}recycle {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         84        8.34        8.34
{txt}        100 {c |}{res}        923       91.66      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,007      100.00
{txt}
{com}. 
. mean recycle if varieties < 3 // 92 of farmers recycle improved seed more than the recommended times (0 times for hybrids and 3 times for OPVs)
{res}
{txt}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 5:1,007}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}recycle {c |}{col 14}{res}{space 2} 91.65839{col 26}{space 2} .8717903{col 37}{space 5} 89.94766{col 51}{space 3} 93.36913
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. mean recycle if varieties < 3, over (sex) // 87% female and 92% male farmers recycle improved seed more than the recommended times (0 times for hybrids and 3 times for OPVs)
{res}
{txt}Mean estimation{col 43}{lalign 13:Number of obs}{col 56} = {res}{ralign 5:1,007}

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}       Mean{col 27}   Std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
c.recycle@sex {c |}
{space 6}Female  {c |}{col 15}{res}{space 2} 86.80556{col 27}{space 2} 2.830097{col 38}{space 5} 81.25199{col 52}{space 3} 92.35913
{txt}{space 8}Male  {c |}{col 15}{res}{space 2} 92.46813{col 27}{space 2} .8988634{col 38}{space 5} 90.70427{col 52}{space 3}   94.232
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
. 
. mean recycle if varieties == 1 // 99% of farmers recycle seed from hybrid varieties when it is not recommended.
{res}
{txt}Mean estimation{col 44}{lalign 13:Number of obs}{col 57} = {res}{ralign 3:667}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}recycle {c |}{col 14}{res}{space 2} 99.10045{col 26}{space 2} .3658587{col 37}{space 5} 98.38207{col 51}{space 3} 99.81883
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. mean recycle if varieties == 1, over (sex) // 99% of both female farmers recycle hybrids seed varieties when it is not recommended. 
{res}
{txt}Mean estimation{col 45}{lalign 13:Number of obs}{col 58} = {res}{ralign 3:667}

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}       Mean{col 27}   Std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
c.recycle@sex {c |}
{space 6}Female  {c |}{col 15}{res}{space 2}  98.9011{col 27}{space 2} 1.098901{col 38}{space 5} 96.74337{col 52}{space 3} 101.0588
{txt}{space 8}Male  {c |}{col 15}{res}{space 2} 99.13194{col 27}{space 2} .3868536{col 38}{space 5} 98.37234{col 52}{space 3} 99.89154
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
. mean recycle if varieties == 2 // 92 of farmers recycle hybrids seed more than the recommended times
{res}
{txt}Mean estimation{col 44}{lalign 13:Number of obs}{col 57} = {res}{ralign 3:340}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 5}recycle {c |}{col 14}{res}{space 2} 77.05882{col 26}{space 2} 2.283596{col 37}{space 5} 72.56702{col 51}{space 3} 81.55062
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. mean recycle if varieties == 2, over (sex) // 87% female and 92% male farmers recycle hybrids seed more than the recommended times 
{res}
{txt}Mean estimation{col 45}{lalign 13:Number of obs}{col 58} = {res}{ralign 3:340}

{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 15}{c |}       Mean{col 27}   Std. err.{col 39}     [95% con{col 52}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
c.recycle@sex {c |}
{space 6}Female  {c |}{col 15}{res}{space 2} 66.03774{col 27}{space 2} 6.567389{col 38}{space 5} 53.11977{col 52}{space 3}  78.9557
{txt}{space 8}Male  {c |}{col 15}{res}{space 2} 79.09408{col 27}{space 2} 2.404494{col 38}{space 5} 74.36447{col 52}{space 3} 83.82368
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
{txt}end of do-file

{com}. do "C:\Users\LNabwire\AppData\Local\Temp\STD25f8_000000.tmp"
{txt}
{com}. destring group4gen_qlty1 - group4germ_rate1, replace ignore ("n/a")
{txt}group4gen_qlty1: characters{res} n / a{txt} removed; {res}replaced {txt}as {res}byte
{txt}(2167 missing values generated)
{res}{txt}group4yield_rate1: characters{res} n / a{txt} removed; {res}replaced {txt}as {res}byte
{txt}(2167 missing values generated)
{res}{txt}group4drt_tol1: characters{res} n / a{txt} removed; {res}replaced {txt}as {res}byte
{txt}(2167 missing values generated)
{res}{txt}group4dies_tol1: characters{res} n / a{txt} removed; {res}replaced {txt}as {res}byte
{txt}(2167 missing values generated)
{res}{txt}group4erly_mat1: characters{res} n / a{txt} removed; {res}replaced {txt}as {res}byte
{txt}(2167 missing values generated)
{res}{txt}group4mrkt_dem1: characters{res} n / a{txt} removed; {res}replaced {txt}as {res}byte
{txt}(2167 missing values generated)
{res}{txt}group4taste1: characters{res} n / a{txt} removed; {res}replaced {txt}as {res}byte
{txt}(2167 missing values generated)
{res}{txt}group4price_rate1: characters{res} n / a{txt} removed; {res}replaced {txt}as {res}byte
{txt}(2167 missing values generated)
{res}{txt}group4avail1: characters{res} n / a{txt} removed; {res}replaced {txt}as {res}byte
{txt}(2167 missing values generated)
{res}{txt}group4germ_rate1: characters{res} n / a{txt} removed; {res}replaced {txt}as {res}byte
{txt}(2167 missing values generated)
{res}{txt}
{com}. 
. gen bazo_genQlty = group4gen_qlty1
{txt}(2,167 missing values generated)

{com}. gen bazo_yield = group4yield_rate1
{txt}(2,167 missing values generated)

{com}. gen bazo_drt = group4drt_tol1
{txt}(2,167 missing values generated)

{com}. gen bazo_dies = group4dies_tol1
{txt}(2,167 missing values generated)

{com}. gen bazo_early = group4erly_mat1
{txt}(2,167 missing values generated)

{com}. gen bazo_mkt = group4mrkt_dem1
{txt}(2,167 missing values generated)

{com}. gen bazo_taste = group4taste1
{txt}(2,167 missing values generated)

{com}. gen bazo_price = group4price_rate1
{txt}(2,167 missing values generated)

{com}. gen bazo_avail = group4avail1
{txt}(2,167 missing values generated)

{com}. gen bazo_germ = group4germ_rate1
{txt}(2,167 missing values generated)

{com}. 
. replace bazo_genQlty = gen_qlty if bazo_genQlty == . & variety == 1
{txt}(159 real changes made)

{com}. replace bazo_yield = yield_rate if bazo_yield == . & variety == 1
{txt}(159 real changes made)

{com}. replace bazo_drt = drt_tol if bazo_drt == . & variety == 1
{txt}(159 real changes made)

{com}. replace bazo_dies = dies_tol if bazo_dies == . & variety == 1
{txt}(159 real changes made)

{com}. replace bazo_early = erly_mat if bazo_early == . & variety == 1
{txt}(159 real changes made)

{com}. replace bazo_mkt = mrkt_dem if bazo_mkt == . & variety == 1
{txt}(159 real changes made)

{com}. replace bazo_taste = taste if bazo_taste == . & variety == 1
{txt}(159 real changes made)

{com}. replace bazo_price = price_rate if bazo_price == . & variety == 1
{txt}(159 real changes made)

{com}. replace bazo_avail = avail if bazo_avail == . & variety == 1
{txt}(159 real changes made)

{com}. replace bazo_germ = germ_rate if bazo_germ == . & variety == 1
{txt}(159 real changes made)

{com}. 
. label define bazo_r 6 "Poorly_rated" 7 "Ok/averagely_rated" 8 "Highly_rated" 98 "Don't_know"
{txt}
{com}. recode bazo_genQlty bazo_yield bazo_drt bazo_dies bazo_early bazo_mkt bazo_taste bazo_avail bazo_germ (1/2=6) (3=7) (4/5=8) (98=98)
{txt}(311 changes made to {bf:bazo_genQlty})
(311 changes made to {bf:bazo_yield})
(306 changes made to {bf:bazo_drt})
(310 changes made to {bf:bazo_dies})
(309 changes made to {bf:bazo_early})
(301 changes made to {bf:bazo_mkt})
(308 changes made to {bf:bazo_taste})
(305 changes made to {bf:bazo_avail})
(311 changes made to {bf:bazo_germ})

{com}. recode bazo_price (4/5=6) (3=7) (1/2=6) (98=98)
{txt}(284 changes made to {bf:bazo_price})

{com}. label values bazo_genQlty bazo_yield bazo_drt bazo_dies bazo_early bazo_mkt bazo_taste bazo_avail bazo_germ bazo_price bazo_r
{txt}
{com}. tab1 bazo_genQlty bazo_yield bazo_drt bazo_dies bazo_early bazo_mkt bazo_taste bazo_avail bazo_germ bazo_price

{res}-> tabulation of bazo_genQlty  

      {txt}bazo_genQlty {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
      Poorly_rated {c |}{res}          7        2.24        2.24
{txt}Ok/averagely_rated {c |}{res}         24        7.69        9.94
{txt}      Highly_rated {c |}{res}        280       89.74       99.68
{txt}        Don't_know {c |}{res}          1        0.32      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}        312      100.00

-> tabulation of bazo_yield  

        {txt}bazo_yield {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
      Poorly_rated {c |}{res}         11        3.53        3.53
{txt}Ok/averagely_rated {c |}{res}         41       13.14       16.67
{txt}      Highly_rated {c |}{res}        259       83.01       99.68
{txt}        Don't_know {c |}{res}          1        0.32      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}        312      100.00

-> tabulation of bazo_drt  

          {txt}bazo_drt {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
      Poorly_rated {c |}{res}         36       11.54       11.54
{txt}Ok/averagely_rated {c |}{res}         97       31.09       42.63
{txt}      Highly_rated {c |}{res}        173       55.45       98.08
{txt}        Don't_know {c |}{res}          6        1.92      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}        312      100.00

-> tabulation of bazo_dies  

         {txt}bazo_dies {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
      Poorly_rated {c |}{res}         96       30.77       30.77
{txt}Ok/averagely_rated {c |}{res}         96       30.77       61.54
{txt}      Highly_rated {c |}{res}        118       37.82       99.36
{txt}        Don't_know {c |}{res}          2        0.64      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}        312      100.00

-> tabulation of bazo_early  

        {txt}bazo_early {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
      Poorly_rated {c |}{res}         17        5.45        5.45
{txt}Ok/averagely_rated {c |}{res}         57       18.27       23.72
{txt}      Highly_rated {c |}{res}        235       75.32       99.04
{txt}        Don't_know {c |}{res}          3        0.96      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}        312      100.00

-> tabulation of bazo_mkt  

          {txt}bazo_mkt {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
      Poorly_rated {c |}{res}         29        9.29        9.29
{txt}Ok/averagely_rated {c |}{res}         98       31.41       40.71
{txt}      Highly_rated {c |}{res}        174       55.77       96.47
{txt}        Don't_know {c |}{res}         11        3.53      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}        312      100.00

-> tabulation of bazo_taste  

        {txt}bazo_taste {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
      Poorly_rated {c |}{res}          5        1.60        1.60
{txt}Ok/averagely_rated {c |}{res}         75       24.04       25.64
{txt}      Highly_rated {c |}{res}        228       73.08       98.72
{txt}        Don't_know {c |}{res}          4        1.28      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}        312      100.00

-> tabulation of bazo_avail  

        {txt}bazo_avail {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
      Poorly_rated {c |}{res}         55       17.63       17.63
{txt}Ok/averagely_rated {c |}{res}        118       37.82       55.45
{txt}      Highly_rated {c |}{res}        132       42.31       97.76
{txt}        Don't_know {c |}{res}          7        2.24      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}        312      100.00

-> tabulation of bazo_germ  

         {txt}bazo_germ {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
      Poorly_rated {c |}{res}          7        2.24        2.24
{txt}Ok/averagely_rated {c |}{res}         44       14.10       16.35
{txt}      Highly_rated {c |}{res}        260       83.33       99.68
{txt}        Don't_know {c |}{res}          1        0.32      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}        312      100.00

-> tabulation of bazo_price  

        {txt}bazo_price {c |}      Freq.     Percent        Cum.
{hline 19}{c +}{hline 35}
      Poorly_rated {c |}{res}        250       80.13       80.13
{txt}Ok/averagely_rated {c |}{res}         34       10.90       91.03
{txt}        Don't_know {c |}{res}         28        8.97      100.00
{txt}{hline 19}{c +}{hline 35}
             Total {c |}{res}        312      100.00
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\LNabwire\AppData\Local\Temp\STD25f8_000000.tmp"
{txt}
{com}. import delimited "C:\Users\LNabwire\OneDrive - CGIAR\L.Nabwire\git\Maize_Uganda\Seed_systems_project_forked\baseline\data\farmer\public\baseline_farmers.csv", varnames(1) clear
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(98 vars, 3,470 obs)

{com}. 
. replace check2checkmaizeq26longe_10h = "1" if check2checkmaizeq26longe_10h == "True"
{txt}(1,781 real changes made)

{com}. replace check2checkmaizeq26longe_7h = "1" if check2checkmaizeq26longe_7h == "True"
{txt}(303 real changes made)

{com}. replace check2checkmaizeq26longe_7r_kayo = "1" if check2checkmaizeq26longe_7r_kayo =="True"
{txt}(265 real changes made)

{com}. replace check2checkmaizeq26bazooka = "1" if check2checkmaizeq26bazooka =="True"
{txt}(505 real changes made)

{com}. replace check2checkmaizeq26longe_6h = "1" if check2checkmaizeq26longe_6h =="True"
{txt}(334 real changes made)

{com}. replace check2checkmaizeq26longe_5 = "1" if check2checkmaizeq26longe_5 =="True"
{txt}(2,273 real changes made)

{com}. replace check2checkmaizeq26longe_4 = "1" if check2checkmaizeq26longe_4 =="True"
{txt}(543 real changes made)

{com}. replace check2checkmaizeq26panner = "1" if check2checkmaizeq26panner =="True"
{txt}(54 real changes made)

{com}. replace check2checkmaizeq26wema = "1" if check2checkmaizeq26wema =="True"
{txt}(34 real changes made)

{com}. replace check2checkmaizeq26kh_series = "1" if check2checkmaizeq26kh_series =="True"
{txt}(262 real changes made)

{com}. replace check2checkmaizeq26land_races = "1" if check2checkmaizeq26land_races =="True"
{txt}(1,466 real changes made)

{com}. replace check2checkmaizeq26other_hybrid = "1" if check2checkmaizeq26other_hybrid =="True"
{txt}(817 real changes made)

{com}. 
. replace check2checkmaizeq26longe_10h = "2" if check2checkmaizeq26longe_10h == "False"
{txt}(1,689 real changes made)

{com}. replace check2checkmaizeq26longe_7h = "2" if check2checkmaizeq26longe_7h == "False"
{txt}(3,167 real changes made)

{com}. replace check2checkmaizeq26longe_7r_kayo = "2" if check2checkmaizeq26longe_7r_kayo =="False"
{txt}(3,205 real changes made)

{com}. replace check2checkmaizeq26bazooka = "2" if check2checkmaizeq26bazooka =="False"
{txt}(2,965 real changes made)

{com}. replace check2checkmaizeq26longe_6h = "2" if check2checkmaizeq26longe_6h =="False"
{txt}(3,136 real changes made)

{com}. replace check2checkmaizeq26longe_5 = "2" if check2checkmaizeq26longe_5 =="False"
{txt}(1,197 real changes made)

{com}. replace check2checkmaizeq26longe_4 = "2" if check2checkmaizeq26longe_4 =="False"
{txt}(2,927 real changes made)

{com}. replace check2checkmaizeq26panner = "2" if check2checkmaizeq26panner =="False"
{txt}(3,416 real changes made)

{com}. replace check2checkmaizeq26wema = "2" if check2checkmaizeq26wema =="False"
{txt}(3,436 real changes made)

{com}. replace check2checkmaizeq26kh_series = "2" if check2checkmaizeq26kh_series =="False"
{txt}(3,208 real changes made)

{com}. replace check2checkmaizeq26land_races = "2" if check2checkmaizeq26land_races =="False"
{txt}(2,004 real changes made)

{com}. replace check2checkmaizeq26other_hybrid = "2" if check2checkmaizeq26other_hybrid =="False"
{txt}(2,653 real changes made)

{com}. 
. destring check2checkmaizeq26longe_10h- check2checkmaizeq26other_hybrid, replace
{txt}check2checkmaizeq26longe_10h: all characters numeric; {res}replaced {txt}as {res}byte
{txt}check2checkmaizeq26longe_7h: all characters numeric; {res}replaced {txt}as {res}byte
{txt}check2checkmaizeq26longe_7r_kayo: all characters numeric; {res}replaced {txt}as {res}byte
{txt}check2checkmaizeq26bazooka: all characters numeric; {res}replaced {txt}as {res}byte
{txt}check2checkmaizeq26longe_6h: all characters numeric; {res}replaced {txt}as {res}byte
{txt}check2checkmaizeq26longe_5: all characters numeric; {res}replaced {txt}as {res}byte
{txt}check2checkmaizeq26longe_4: all characters numeric; {res}replaced {txt}as {res}byte
{txt}check2checkmaizeq26panner: all characters numeric; {res}replaced {txt}as {res}byte
{txt}check2checkmaizeq26wema: all characters numeric; {res}replaced {txt}as {res}byte
{txt}check2checkmaizeq26kh_series: all characters numeric; {res}replaced {txt}as {res}byte
{txt}check2checkmaizeq26land_races: all characters numeric; {res}replaced {txt}as {res}byte
{txt}check2checkmaizeq26other_hybrid: all characters numeric; {res}replaced {txt}as {res}byte
{txt}
{com}. recode check2checkmaizeq26longe_10h- check2checkmaizeq26other_hybrid (1=100) (2=0)
{txt}(3470 changes made to {bf:check2checkmaizeq26longe_10h})
(3470 changes made to {bf:check2checkmaizeq26longe_7h})
(3470 changes made to {bf:check2checkmaizeq26longe_7r_kayo})
(3470 changes made to {bf:check2checkmaizeq26bazooka})
(3470 changes made to {bf:check2checkmaizeq26longe_6h})
(3470 changes made to {bf:check2checkmaizeq26longe_5})
(3470 changes made to {bf:check2checkmaizeq26longe_4})
(3470 changes made to {bf:check2checkmaizeq26panner})
(3470 changes made to {bf:check2checkmaizeq26wema})
(3470 changes made to {bf:check2checkmaizeq26kh_series})
(3470 changes made to {bf:check2checkmaizeq26land_races})
(3470 changes made to {bf:check2checkmaizeq26other_hybrid})

{com}. 
. // % of farmers that are aware of different varieties: 2021 maize survey
. mean check2checkmaizeq26longe_10h- check2checkmaizeq26other_hybrid // 15% were aware about Bazooka 
{res}
{txt}Mean estimation{col 62}{lalign 13:Number of obs}{col 75} = {res}{ralign 5:3,470}

{txt}{hline 33}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 34}{c |}       Mean{col 46}   Std. err.{col 58}     [95% con{col 71}f. interval]
{hline 33}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}check2checkmaizeq26longe_10h {c |}{col 34}{res}{space 2} 51.32565{col 46}{space 2} .8486237{col 57}{space 5}  49.6618{col 71}{space 3}  52.9895
{txt}{space 5}check2checkmaizeq26longe_7h {c |}{col 34}{res}{space 2} 8.731988{col 46}{space 2} .4793069{col 57}{space 5} 7.792236{col 71}{space 3} 9.671741
{txt}check2checkmaizeq26longe_7r_kayo {c |}{col 34}{res}{space 2} 7.636888{col 46}{space 2} .4509261{col 57}{space 5}  6.75278{col 71}{space 3} 8.520995
{txt}{space 6}check2checkmaizeq26bazooka {c |}{col 34}{res}{space 2} 14.55331{col 46}{space 2} .5987236{col 57}{space 5} 13.37943{col 71}{space 3}  15.7272
{txt}{space 5}check2checkmaizeq26longe_6h {c |}{col 34}{res}{space 2}  9.62536{col 46}{space 2}   .50076{col 57}{space 5} 8.643546{col 71}{space 3} 10.60717
{txt}{space 6}check2checkmaizeq26longe_5 {c |}{col 34}{res}{space 2} 65.50432{col 46}{space 2} .8070774{col 57}{space 5} 63.92193{col 71}{space 3} 67.08672
{txt}{space 6}check2checkmaizeq26longe_4 {c |}{col 34}{res}{space 2} 15.64841{col 46}{space 2} .6168501{col 57}{space 5} 14.43899{col 71}{space 3} 16.85784
{txt}{space 7}check2checkmaizeq26panner {c |}{col 34}{res}{space 2} 1.556196{col 46}{space 2} .2101475{col 57}{space 5} 1.144171{col 71}{space 3} 1.968221
{txt}{space 9}check2checkmaizeq26wema {c |}{col 34}{res}{space 2} .9798271{col 46}{space 2} .1672378{col 57}{space 5} .6519326{col 71}{space 3} 1.307722
{txt}{space 4}check2checkmaizeq26kh_series {c |}{col 34}{res}{space 2} 7.550432{col 46}{space 2} .4485762{col 57}{space 5} 6.670932{col 71}{space 3} 8.429932
{txt}{space 3}check2checkmaizeq26land_races {c |}{col 34}{res}{space 2} 42.24784{col 46}{space 2} .8386567{col 57}{space 5} 40.60353{col 71}{space 3} 43.89215
{txt}{space 1}check2checkmaizeq26other_hybrid {c |}{col 34}{res}{space 2} 23.54467{col 46}{space 2} .7203574{col 57}{space 5}  22.1323{col 71}{space 3} 24.95704
{txt}{hline 33}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
. // 2021 adoption of maize varieties: estimated by looking at the variety that was planted on a randomly selected crop
. rename check2checkmaizeq31 varietyplanted
{res}{txt}
{com}. tab varietyplanted, sort

{txt}Check2.check.maize. {c |}
                q31 {c |}      Freq.     Percent        Cum.
{hline 20}{c +}{hline 35}
         Land_Races {c |}{res}      1,486       42.82       42.82
{txt}            Longe_5 {c |}{res}        745       21.47       64.29
{txt}          Longe_10H {c |}{res}        507       14.61       78.90
{txt}       Other_hybrid {c |}{res}        194        5.59       84.50
{txt}            Bazooka {c |}{res}        176        5.07       89.57
{txt}                 98 {c |}{res}        152        4.38       93.95
{txt}            Longe_4 {c |}{res}         68        1.96       95.91
{txt}          KH_series {c |}{res}         57        1.64       97.55
{txt}Longe_7R_Kayongo-go {c |}{res}         30        0.86       98.41
{txt}           Longe_6H {c |}{res}         28        0.81       99.22
{txt}           Longe_7H {c |}{res}         23        0.66       99.88
{txt}             Panner {c |}{res}          2        0.06       99.94
{txt}               Wema {c |}{res}          2        0.06      100.00
{txt}{hline 20}{c +}{hline 35}
              Total {c |}{res}      3,470      100.00
{txt}
{com}. 
. // varieties planted on the selected plot in 2021
. replace varietyplanted = "1" if varietyplanted == "Longe_10H"
{txt}(507 real changes made)

{com}. replace varietyplanted = "2" if varietyplanted == "Longe_7H"
{txt}(23 real changes made)

{com}. replace varietyplanted = "3" if varietyplanted == "Longe_7R_Kayongo-go"
{txt}(30 real changes made)

{com}. replace varietyplanted = "4" if varietyplanted == "Bazooka"
{txt}(176 real changes made)

{com}. replace varietyplanted = "5" if varietyplanted == "Longe_6H"
{txt}(28 real changes made)

{com}. replace varietyplanted = "6" if varietyplanted == "Longe_5"
{txt}(745 real changes made)

{com}. replace varietyplanted = "7" if varietyplanted == "Longe_4"
{txt}(68 real changes made)

{com}. replace varietyplanted = "8" if varietyplanted == "Panner"
{txt}(2 real changes made)

{com}. replace varietyplanted = "9" if varietyplanted == "Wema"
{txt}(2 real changes made)

{com}. replace varietyplanted = "10" if varietyplanted == "KH_series"
{txt}(57 real changes made)

{com}. replace varietyplanted = "11" if varietyplanted == "Land_Races"
{txt}(1,486 real changes made)

{com}. replace varietyplanted = "12" if varietyplanted == "Other_hybrid"
{txt}(194 real changes made)

{com}. 
. destring varietyplanted, replace
{txt}varietyplanted: all characters numeric; {res}replaced {txt}as {res}byte
{txt}
{com}. 
. label define variety2021 1 "Longe 10H" 2 "Longe 7H" 3 "Longe 7R/Kayongo-go" 4 "Bazooka" 5 "Longe 6H" 6 "Longe 5 (nalongo)" 7 "Longe 4" 8 "Panner" 9 "Wema" 10 "KH series" 11 "Land Races/local varieties" 12 "Others" 98 "Don't know"
{txt}
{com}. label values varietyplanted variety2021
{txt}
{com}. tab varietyplanted // 5% planted Bazooka

    {txt}Check2.check.maize.q31 {c |}      Freq.     Percent        Cum.
{hline 27}{c +}{hline 35}
                 Longe 10H {c |}{res}        507       14.61       14.61
{txt}                  Longe 7H {c |}{res}         23        0.66       15.27
{txt}       Longe 7R/Kayongo-go {c |}{res}         30        0.86       16.14
{txt}                   Bazooka {c |}{res}        176        5.07       21.21
{txt}                  Longe 6H {c |}{res}         28        0.81       22.02
{txt}         Longe 5 (nalongo) {c |}{res}        745       21.47       43.49
{txt}                   Longe 4 {c |}{res}         68        1.96       45.45
{txt}                    Panner {c |}{res}          2        0.06       45.50
{txt}                      Wema {c |}{res}          2        0.06       45.56
{txt}                 KH series {c |}{res}         57        1.64       47.20
{txt}Land Races/local varieties {c |}{res}      1,486       42.82       90.03
{txt}                    Others {c |}{res}        194        5.59       95.62
{txt}                Don't know {c |}{res}        152        4.38      100.00
{txt}{hline 27}{c +}{hline 35}
                     Total {c |}{res}      3,470      100.00
{txt}
{com}. 
{txt}end of do-file

{com}. exit, clear
