{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\LNabwire\OneDrive - CGIAR\L.Nabwire\git\Maize_Uganda\mippi_UG\baseline\2slides_for_Berber\2slides_for_Berber.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}21 Apr 2023, 10:32:59
{txt}
{com}. 
. import delimited "C:\Users\LNabwire\OneDrive - CGIAR\L.Nabwire\git\Maize_Uganda\mippi_UG\baseline\data\public\baseline.csv", varnames(1)
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{p 0 4 2} Note: Unmatched quote while processing row 337; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 338; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 672; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 673; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 697; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 698; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 1248; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 1249; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 1258; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 1259; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 1327; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 1328; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 1638; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{p 0 4 2} Note: Unmatched quote while processing row 1640; this can be due to a formatting problem in the file or because a quoted data element spans multiple lines. You should carefully inspect your data after importing. Consider using option bindquote(strict) if quoted data spans multiple lines or option bindquote(nobind) if quotes are not used for binding data.{p_end}
{text}(229 vars, 2,327 obs)

{com}. 
. count
  {res}2,327
{txt}
{com}. sort farmer_id
{txt}
{com}. drop if farmer_id == ""
{txt}(7 observations deleted)

{com}. count // 2320 total sample
  {res}2,320
{txt}
{com}. 
. ********** GENDER OF THE HOUSEHOLD HEAD ***********
. tab gender // 20% are female headed households.

     {txt}gender {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
     Female {c |}{res}        475       20.47       20.47
{txt}       Male {c |}{res}      1,845       79.53      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,320      100.00
{txt}
{com}. 
. gen sex = gender
{txt}
{com}. replace sex = "1" if sex == "Female"
{txt}(475 real changes made)

{com}. replace sex = "2" if sex == "Male"
{txt}(1,845 real changes made)

{com}. label define sex 1 "Female" 2 "Male"
{txt}
{com}. destring sex, replace
{txt}sex: all characters numeric; {res}replaced {txt}as {res}byte
{txt}
{com}. label values sex sex
{txt}
{com}. label var sex "gender of hh head"
{txt}
{com}. tab sex

  {txt}gender of {c |}
    hh head {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
     Female {c |}{res}        475       20.47       20.47
{txt}       Male {c |}{res}      1,845       79.53      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,320      100.00
{txt}
{com}. 
. **************% OF FARMERS USING IMPROVED SEED ************** 
. // MIPPI baseline data, Q20. Did you use any quality maize seed like **OPV or hybrid seed** in the previous season (Nsambya of 2022) on any of your plots?
. gen improved = quality_use
{txt}
{com}. replace improved = "1" if improved =="Yes"
{txt}(935 real changes made)

{com}. replace improved = "2" if improved =="No"
{txt}(1,372 real changes made)

{com}. destring improved, replace
{txt}improved: all characters numeric; {res}replaced {txt}as {res}byte
{txt}
{com}. recode improved (1=100) (nonmissing=0)
{txt}(2320 changes made to {bf:improved})

{com}. tab improved

   {txt}improved {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,385       59.70       59.70
{txt}        100 {c |}{res}        935       40.30      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,320      100.00
{txt}
{com}. mean improved
{res}
{txt}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 5:2,320}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}improved {c |}{col 14}{res}{space 2} 40.30172{col 26}{space 2} 1.018573{col 37}{space 5} 38.30431{col 51}{space 3} 42.29913
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. mean improved, over (sex)
{res}
{txt}Mean estimation{col 44}{lalign 13:Number of obs}{col 57} = {res}{ralign 5:2,320}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 16}{c |}       Mean{col 28}   Std. err.{col 40}     [95% con{col 53}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
c.improved@sex {c |}
{space 7}Female  {c |}{col 16}{res}{space 2} 26.10526{col 28}{space 2} 2.017352{col 39}{space 5} 22.14926{col 53}{space 3} 30.06126
{txt}{space 9}Male  {c |}{col 16}{res}{space 2} 43.95664{col 28}{space 2}  1.15583{col 39}{space 5} 41.69007{col 53}{space 3} 46.22321
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
. // which varieties: MIPPI baseline data, Q28. What maize variety did you plant in second season (Nsambya) of 2022 on this ${c -(}plot_select_name{c )-} plot?
. gen varieties = maize_var
{txt}
{com}. replace varieties = "1" if varieties == "Bazooka"
{txt}(159 real changes made)

{com}. replace varieties = "1" if varieties == "KH_series"
{txt}(7 real changes made)

{com}. replace varieties = "1" if varieties == "Longe_10H"
{txt}(317 real changes made)

{com}. replace varieties = "1" if varieties == "Longe_6H"
{txt}(5 real changes made)

{com}. replace varieties = "1" if varieties == "Longe_7H"
{txt}(17 real changes made)

{com}. replace varieties = "1" if varieties == "Other_hybrid"
{txt}(100 real changes made)

{com}. replace varieties = "1" if varieties == "Longe_7R_Kayongo-go"
{txt}(26 real changes made)

{com}. replace varieties = "1" if varieties == "Panner"
{txt}(1 real change made)

{com}. replace varieties = "1" if varieties == "Wema"
{txt}(1 real change made)

{com}. replace varieties = "1" if varieties == "DK"
{txt}(34 real changes made)

{com}. replace varieties = "2" if varieties == "Longe_4"
{txt}(37 real changes made)

{com}. replace varieties = "2" if varieties == "Longe_5"
{txt}(303 real changes made)

{com}. replace varieties = "3" if varieties == "Land_Races"
{txt}(1,207 real changes made)

{com}. replace varieties = "4" if varieties == "98"
{txt}(106 real changes made)

{com}. 
. label define varieties 1 "Hybrids" 2 "OPV" 3 "Landraces" 4 "Don't know"
{txt}
{com}. destring varieties, replace
{txt}varieties: all characters numeric; {res}replaced {txt}as {res}byte
{txt}
{com}. label values varieties varieties
{txt}
{com}. tab varieties // Most farmers use land races (52%), then hybrids (29%), then OPV (15%), the rest--- use other hybrid (5%)

  {txt}varieties {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
    Hybrids {c |}{res}        667       28.75       28.75
{txt}        OPV {c |}{res}        340       14.66       43.41
{txt}  Landraces {c |}{res}      1,207       52.03       95.43
{txt} Don't know {c |}{res}        106        4.57      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,320      100.00
{txt}
{com}. tab varieties sex, col nofreq

           {txt}{c |}   gender of hh head
 varieties {c |}    Female       Male {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
   Hybrids {c |}{res}     19.16      31.22 {txt}{c |}{res}     28.75 
{txt}       OPV {c |}{res}     11.16      15.56 {txt}{c |}{res}     14.66 
{txt} Landraces {c |}{res}     61.05      49.70 {txt}{c |}{res}     52.03 
{txt}Don't know {c |}{res}      8.63       3.52 {txt}{c |}{res}      4.57 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}    100.00     100.00 {txt}{c |}{res}    100.00 
{txt}
{com}. 
. // used bazooka: MIPPI baseline data, Q21. Did you use Bazooka in the second season of **2022 (Nsambya 2022)** on any of your plots? 
. tab bazo_use

   {txt}bazo_use {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
         98 {c |}{res}          8        0.34        0.34
{txt}         No {c |}{res}        707       30.47       30.82
{txt}        Yes {c |}{res}        220        9.48       40.30
{txt}        n/a {c |}{res}      1,385       59.70      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,320      100.00
{txt}
{com}. tab bazo_use sex, col nofreq

           {txt}{c |}   gender of hh head
  bazo_use {c |}    Female       Male {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
        98 {c |}{res}      0.00       0.43 {txt}{c |}{res}      0.34 
{txt}        No {c |}{res}     20.00      33.17 {txt}{c |}{res}     30.47 
{txt}       Yes {c |}{res}      6.11      10.35 {txt}{c |}{res}      9.48 
{txt}       n/a {c |}{res}     73.89      56.04 {txt}{c |}{res}     59.70 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}    100.00     100.00 {txt}{c |}{res}    100.00 
{txt}
{com}. 
. **** NUMBER OF YEARS THE FARMER HAS USED THE VARIETY ************
. // MIPPI baseline data: Q28b. For how long in years have you been using ${c -(}maize_var{c )-}?
. 
. mean long_var // overall, farmers have used the varieties they reported for 30years
{res}
{txt}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 5:2,320}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}long_var {c |}{col 14}{res}{space 2} 30.21724{col 26}{space 2} 3.054436{col 37}{space 5} 24.22753{col 51}{space 3} 36.20695
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
{txt}end of do-file

{com}. mean long_var
{res}
{txt}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 5:2,320}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}long_var {c |}{col 14}{res}{space 2} 30.21724{col 26}{space 2} 3.054436{col 37}{space 5} 24.22753{col 51}{space 3} 36.20695
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. mean long_var [pweight = plot_size]
{res}
{txt}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 5:2,319}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}long_var {c |}{col 14}{res}{space 2} 19.62221{col 26}{space 2} 5.422057{col 37}{space 5} 8.989622{col 51}{space 3}  30.2548
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. mean long_var if varieties < 3
{res}
{txt}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 5:1,007}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}long_var {c |}{col 14}{res}{space 2} 8.396226{col 26}{space 2} 1.980326{col 37}{space 5} 4.510184{col 51}{space 3} 12.28227
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. mean long_var if varieties < 3 [pweight = plot_size]
{res}
{txt}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 5:1,007}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 4}long_var {c |}{col 14}{res}{space 2} 6.495424{col 26}{space 2} 1.150513{col 37}{space 5} 4.237744{col 51}{space 3} 8.753103
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. exit, clear
